app/controllers/participants_controller.rb

SELECT "participants".* FROM "participants"
---
  def index
    @participants = Participant.all

INSERT INTO "participants" ("first_name", "last_name", "birthdate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "liz"], ["last_name", "johnson"], ["birthdate", "1992-05-17"], ["created_at", "2023-02-26 11:52:54.585127"], ["updated_at", "2023-02-26 11:52:54.585127"]]
---
  def create
    @participant = Participant.create(participant_params)